88099981/omnidirectional/LQ_CH32V103R8T6/2.example/13/13.LQ_CH32V103_TestBluetooth/User/include.h
#ifndef __LQINCLUDES_H
#define __LQINCLUDES_H	  

    #include <string.h>
    #include <stdio.h>
    #include <stdint.h>
    #include <stdlib.h>
    #include <string.h>
    #include <math.h>
    #include "system_ch32v10x.h"
    #include "ch32v10x.h"
    #include "ch32v10x_conf.h"

    #include <ANO_DT.h>
    #include <LQ_ADC.h>
    #include <LQ_CAMERA.h>
    #include <LQ_Encoder.h>
    #include <LQ_GPIO.h>
    #include <LQ_GPIO_KEY.h>
    #include <LQ_GPIO_LED.h>
    #include <LQ_GPIO_EXIT.h>
    #include <LQ_I2C.h>
    #include "LQ_ImageProcess.h"
    #include <LQ_Inductor.h>
    #include <LQ_MotorServo.h>
    #include <LQ_MT9V034.h>
    #include <LQ_OLED096.h>
    #include <LQ_PWM.h>
    #include <LQ_SPI.h>
    #include <LQ_SYS.h>
    #include <LQ_TFT18.h>
    #include <LQ_TIMER.h>
    #include <LQ_UART.h>
    #include <LQ_DMA.h>
    #include <LQ_PID.h>

    #include "hcar_gogogo.h"
    #include "hcar_init.h"
    #include "hcar_encoder.h"
#endif









